<a href="https://colab.research.google.com/github/Rishabh9559/Data_science/blob/main/SQL/retrieving_SELECT/Retrieving_data_with_select.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Retrieving Data with Select Statements**

#### **INSERT** : INSERT INTO table-name VALUES ("rishabh", "kushwaha", 78 )

  * Insert value into table

**INSERT WITH COLUMN AND VALUE**

INSERT INTO table-name (ID, NAME, ADDRESS) VALUES (45, "rk", "india")

### **ALTER** Modify a Single Column Data Type



```
ALTER TABLE table_name
MODIFY COLUMN column_name NEW_DATATYPE

```

### **NOT NULL** Constraint

* To avoid any null value in specific column

    

```
CREATE TABLE table-name(
  id int PRIMARY KEY,
  first-name varchar(100) NOT NULL,
  address varchar(100) NOT NULL
)
```